#include "feature_type.h"

std::vector<FeatType> TV::sign = {
    {"直行", 0},    {"禁止直行", 1}, {"右转", 2},     {"禁止右转", 3},
    {"左转", 4},    {"禁止左转", 5}, {"禁止行人", 6}, {"禁止非机动车", 7},
    {"限速", 8},    {"解除限速", 9}, {"限高", 10},    {"限重", 11},
    {"限轴重", 12}, {"限宽", 13},    {"红绿灯", 14},  {"未知", none}};

// clang-format off
// std::vector<FeatType> TV::boundary ={
//     {"白实线", 1}, {"白虚线", 2}, {"黄实线", 3}, {"黄虚线", 4},
//     {"双白实", BT::L2(1, 1)}, {"双白虚", BT::L2(2, 2)},
//     {"左白虚右白实", BT::L2(2, 1)}, {"左白实右白虚", BT::L2(1, 2)},
//     {"双黄实", BT::L2(3, 3)}, {"未知", none}};
std::vector<FeatType> TV::boundary ={
    {"实线", 1}, {"虚线", 2}, {"水沟", 3}, {"路沿", 4}};
// clang-format on
std::vector<FeatType> TV::roadarea = {
    {"停止线", 0}, {"斑马线", 1}, {"未知", none}};

// std::vector<FeatType> TV::laneturn = {{"直行", 0},     {"左转", 1},
//                                       {"右转", 2},     {"直行左转", 3},
//                                       {"直行右转", 4}, {"未知", none}};
std::vector<FeatType> TV::laneturn = {
    {"上坡", 0}, {"下坡", 1}, {"平路", 2}, {"前进", 3}, {"后退", 4}};
std::vector<FeatType> TV::lanetype = {
    {"主路", 0}, {"驶入参考线", 11}, {"倒车参考线", 12}, {"驶离参考线", 13}};

std::vector<FeatType> TV::jobarea = {
    {"铲装区", 0}, {"破碎站", 1},        {"排土区", 2},
    {"路口", 3},   {"停车区", 4},        {"障碍区", 5},
    {"可行驶区", 6}, {"停车点", jobpoint}, {"倒车点", 101}};